'''
Компьютерная программа — список команд (инструкций) для компьютера.

Язык программирования — набор определенных правил, по которым компьютер может понимать команды (инструкции) и выполнять их.

Программный код — текст программы.

Язык Python разработал голландский программист Гвидо Ван Россум (Guido van Rossum) в 1991 году.

Преимущества Python:

- Это интерпретируемый язык программирования.
- Это высокоуровневый язык программирования.
- Это платформонезависимый язык.
- Это open source проект.
- Это простой язык.
- Это встраиваемый скриптовый язык.
- Это динамический язык, что упрощает написание несложных программ.
- Для Python существует огромная библиотека классов на любой вкус.

Недостатки Python:

- Низкая скорость выполнения по сравнению с такими языками, как C и C++.
- Динамическая типизация языка — минус при написании сложных программ.

Задачи, решаемые с помощью Python:

- Системное программирование.
- Графические приложения.
- Веб-приложения.
- Веб-сценарии.
- Интеграция компонентов.
- Приложения баз данных.
'''

